import { Box, Typography } from '@mui/material'
import React from 'react'
import Slider from '../slider/Slider'
import Blog from './Blog'


const slides = [
    {src: '/images/Intersect.png', title: 'متن تست', des: 'اگر شما یک طراح هستین و یا با طراحی های گرافیکی سروکار دارید به متن های برخورده اید که با نام لورم ایپسوم شناخته می‌شوند. لورم ایپسوم یا طرح‌نما'},
    {src: '/images/Intersect (1).png', title: 'متن تست', des: 'اگر شما یک طراح هستین و یا با طراحی های گرافیکی سروکار دارید به متن های برخورده اید که با نام لورم ایپسوم شناخته می‌شوند. لورم ایپسوم یا طرح‌نما'},
    {src: '/images/Intersect (2).png', title: 'متن تست', des: 'اگر شما یک طراح هستین و یا با طراحی های گرافیکی سروکار دارید به متن های برخورده اید که با نام لورم ایپسوم شناخته می‌شوند. لورم ایپسوم یا طرح‌نما'},
    {src: '/images/Intersect (3).png', title: 'متن تست', des: 'اگر شما یک طراح هستین و یا با طراحی های گرافیکی سروکار دارید به متن های برخورده اید که با نام لورم ایپسوم شناخته می‌شوند. لورم ایپسوم یا طرح‌نما'},
    {src: '/images/Intersect (4).png', title: 'متن تست', des: 'اگر شما یک طراح هستین و یا با طراحی های گرافیکی سروکار دارید به متن های برخورده اید که با نام لورم ایپسوم شناخته می‌شوند. لورم ایپسوم یا طرح‌نما'},
    {src: '/images/Intersect (2).png', title: 'متن تست', des: 'اگر شما یک طراح هستین و یا با طراحی های گرافیکی سروکار دارید به متن های برخورده اید که با نام لورم ایپسوم شناخته می‌شوند. لورم ایپسوم یا طرح‌نما'},
    {src: '/images/Intersect (3).png', title: 'متن تست', des: 'اگر شما یک طراح هستین و یا با طراحی های گرافیکی سروکار دارید به متن های برخورده اید که با نام لورم ایپسوم شناخته می‌شوند. لورم ایپسوم یا طرح‌نما'},
    {src: '/images/Intersect (4).png', title: 'متن تست', des: 'اگر شما یک طراح هستین و یا با طراحی های گرافیکی سروکار دارید به متن های برخورده اید که با نام لورم ایپسوم شناخته می‌شوند. لورم ایپسوم یا طرح‌نما'},
    {src: '/images/Intersect (2).png', title: 'متن تست', des: 'اگر شما یک طراح هستین و یا با طراحی های گرافیکی سروکار دارید به متن های برخورده اید که با نام لورم ایپسوم شناخته می‌شوند. لورم ایپسوم یا طرح‌نما'},
    {src: '/images/Intersect (3).png', title: 'متن تست', des: 'اگر شما یک طراح هستین و یا با طراحی های گرافیکی سروکار دارید به متن های برخورده اید که با نام لورم ایپسوم شناخته می‌شوند. لورم ایپسوم یا طرح‌نما'},
    {src: '/images/Intersect (4).png', title: 'متن تست', des: 'اگر شما یک طراح هستین و یا با طراحی های گرافیکی سروکار دارید به متن های برخورده اید که با نام لورم ایپسوم شناخته می‌شوند. لورم ایپسوم یا طرح‌نما'},
]

const Blogs = () => {
  return (
    <Box marginTop={{xs: 4, sm: 8, md: 12}}>
      <Box textAlign={'center'}>
        <Typography sx={{
          fontWeight: '400',
          fontSize:{
            xs: 32,
            sm: 42
          },
        }}>برترین مقالات</Typography>
      </Box>

    <Box marginTop={{xs: 2, sm: 4, md: 6}} paddingX={{xs: 0, sm: 8, md: 16}}>
    <Slider slides={slides}/>
    </Box>

    </Box>
  )
}

export default Blogs
